<template>
  <header id="sub_header">
    <button class="back">
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
      >
        <path
          d="M14 6L8.70708 11.2929C8.31655 11.6834 8.31655 12.3166 8.70708 12.7071L14 18"
          stroke="black"
          stroke-width="2"
          stroke-linecap="round"
        />
      </svg>
    </button>
    <!-- 뒤로가기 -->

    <div class="page-title">
      <span>{{ title }}</span>
      <!-- 타이틀 -->

      <button>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="14"
          height="17"
          viewBox="0 0 14 17"
          fill="none"
        >
          <circle cx="7" cy="9" r="6" fill="#FFCE4F" />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M4.66667 0.791667C4.66667 0.354441 5.01489 0 5.44444 0H8.55556C8.98511 0 9.33333 0.354441 9.33333 0.791667C9.33333 1.22889 8.98511 1.58333 8.55556 1.58333H7.77778V2.41849C9.12789 2.5704 10.3623 3.11313 11.3693 3.93308L11.8945 3.39854C12.1982 3.08938 12.6907 3.08938 12.9944 3.39854C13.2982 3.70771 13.2982 4.20896 12.9944 4.51813L12.4693 5.05267C13.4272 6.27157 14 7.8177 14 9.5C14 13.435 10.866 16.625 7 16.625C3.13401 16.625 0 13.435 0 9.5C0 5.83256 2.72226 2.8123 6.22222 2.41849V1.58333H5.44444C5.01489 1.58333 4.66667 1.22889 4.66667 0.791667ZM7 3.95833C3.99312 3.95833 1.55556 6.43942 1.55556 9.5C1.55556 12.5606 3.99312 15.0417 7 15.0417C10.0069 15.0417 12.4444 12.5606 12.4444 9.5C12.4444 6.43942 10.0069 3.95833 7 3.95833ZM7 5.54167C7.42956 5.54167 7.77778 5.89611 7.77778 6.33333V9.5C7.77778 9.93723 7.42956 10.2917 7 10.2917C6.57045 10.2917 6.22222 9.93723 6.22222 9.5V6.33333C6.22222 5.89611 6.57045 5.54167 7 5.54167Z"
            fill="#0C0C20"
          />
        </svg>

        시황 알림 설정
      </button>
      <!-- 버튼 -->
    </div>
    <!-- 페이지 타이틀 -->
  </header>
  <!-- header -->
</template>
<script>
export default {
  computed: {
    title() {
      return this.$store.state.pageTitle;
    },
  },
};
</script>

<style scoped>
@import "~/assets/css/header.css";
</style>
