<template>
  <div id="container" class="sub">
    <div id="itemSetting">
      <div class="top">
        <SearchModal />
      </div>
      <!-- top -->

      <div class="content">
        <div class="my-item-list">
          <div class="item">
            <span class="name">
              셀트리온제약
              <em>005970</em>
            </span>
            <!-- 종목명 -->

            <button>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
              >
                <g clip-path="url(#clip0_14_2219)">
                  <path
                    d="M8 11C7.44772 11 7 11.4477 7 12C7 12.5523 7.44772 13 8 13H12H16C16.5523 13 17 12.5523 17 12C17 11.4477 16.5523 11 16 11H8Z"
                    fill="#495062"
                  />
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24C18.6274 24 24 18.6274 24 12C24 5.37258 18.6274 0 12 0ZM12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2Z"
                    fill="#495062"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_14_2219">
                    <rect width="24" height="24" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </button>
          </div>

          <div class="item">
            <span class="name">
              셀트리온제약
              <em>005970</em>
            </span>
            <!-- 종목명 -->

            <button>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
              >
                <g clip-path="url(#clip0_14_2219)">
                  <path
                    d="M8 11C7.44772 11 7 11.4477 7 12C7 12.5523 7.44772 13 8 13H12H16C16.5523 13 17 12.5523 17 12C17 11.4477 16.5523 11 16 11H8Z"
                    fill="#495062"
                  />
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24C18.6274 24 24 18.6274 24 12C24 5.37258 18.6274 0 12 0ZM12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2Z"
                    fill="#495062"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_14_2219">
                    <rect width="24" height="24" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </button>
          </div>
          <!-- // -->

          <div class="item">
            <span class="name">
              셀트리온제약
              <em>005970</em>
            </span>
            <!-- 종목명 -->

            <button>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
              >
                <g clip-path="url(#clip0_14_2219)">
                  <path
                    d="M8 11C7.44772 11 7 11.4477 7 12C7 12.5523 7.44772 13 8 13H12H16C16.5523 13 17 12.5523 17 12C17 11.4477 16.5523 11 16 11H8Z"
                    fill="#495062"
                  />
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24C18.6274 24 24 18.6274 24 12C24 5.37258 18.6274 0 12 0ZM12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2Z"
                    fill="#495062"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_14_2219">
                    <rect width="24" height="24" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </button>
          </div>
          <!-- // -->

          <div class="item">
            <span class="name">
              셀트리온제약
              <em>005970</em>
            </span>
            <!-- 종목명 -->

            <button>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
              >
                <g clip-path="url(#clip0_14_2219)">
                  <path
                    d="M8 11C7.44772 11 7 11.4477 7 12C7 12.5523 7.44772 13 8 13H12H16C16.5523 13 17 12.5523 17 12C17 11.4477 16.5523 11 16 11H8Z"
                    fill="#495062"
                  />
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24C18.6274 24 24 18.6274 24 12C24 5.37258 18.6274 0 12 0ZM12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2Z"
                    fill="#495062"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_14_2219">
                    <rect width="24" height="24" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </button>
          </div>
          <!-- // -->
          <!-- // -->
        </div>
        <!-- item-list -->

        <div class="btn-box">
          <button>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="20"
              height="20"
              viewBox="0 0 20 20"
              fill="none"
            >
              <path
                opacity="0.4"
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M8.25 17.5C8.25 17.0858 8.58579 16.75 9 16.75H19C19.4142 16.75 19.75 17.0858 19.75 17.5C19.75 17.9142 19.4142 18.25 19 18.25H9C8.58579 18.25 8.25 17.9142 8.25 17.5Z"
                fill="#E2E6EC"
              />
              <path
                opacity="0.4"
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M8.25 10.5C8.25 10.0858 8.58579 9.75 9 9.75H19C19.4142 9.75 19.75 10.0858 19.75 10.5C19.75 10.9142 19.4142 11.25 19 11.25H9C8.58579 11.25 8.25 10.9142 8.25 10.5Z"
                fill="#E2E6EC"
              />
              <path
                opacity="0.4"
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M8.25 3.5C8.25 3.08579 8.58579 2.75 9 2.75H19C19.4142 2.75 19.75 3.08579 19.75 3.5C19.75 3.91421 19.4142 4.25 19 4.25H9C8.58579 4.25 8.25 3.91421 8.25 3.5Z"
                fill="#E2E6EC"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M5.53033 0.96967C5.82322 1.26256 5.82322 1.73744 5.53033 2.03033L2.53033 5.03033C2.23744 5.32322 1.76256 5.32322 1.46967 5.03033L0.46967 4.03033C0.176777 3.73744 0.176777 3.26256 0.46967 2.96967C0.762563 2.67678 1.23744 2.67678 1.53033 2.96967L2 3.43934L4.46967 0.96967C4.76256 0.676777 5.23744 0.676777 5.53033 0.96967Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M5.53033 7.96967C5.82322 8.26256 5.82322 8.73744 5.53033 9.03033L2.53033 12.0303C2.23744 12.3232 1.76256 12.3232 1.46967 12.0303L0.46967 11.0303C0.176777 10.7374 0.176777 10.2626 0.46967 9.96967C0.762563 9.67678 1.23744 9.67678 1.53033 9.96967L2 10.4393L4.46967 7.96967C4.76256 7.67678 5.23744 7.67678 5.53033 7.96967Z"
                fill="white"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M5.53033 14.9697C5.82322 15.2626 5.82322 15.7374 5.53033 16.0303L2.53033 19.0303C2.23744 19.3232 1.76256 19.3232 1.46967 19.0303L0.46967 18.0303C0.176777 17.7374 0.176777 17.2626 0.46967 16.9697C0.762563 16.6768 1.23744 16.6768 1.53033 16.9697L2 17.4393L4.46967 14.9697C4.76256 14.6768 5.23744 14.6768 5.53033 14.9697Z"
                fill="white"
              />
            </svg>
            나의 종목 설정 완료
          </button>
        </div>
      </div>
      <!-- content -->
    </div>
    <!--  -->
  </div>
</template>
<script>
import SearchModal from '~/components/modal/SearchModal'
export default {
  components: {
    SearchModal
  },
  layout: 'subLayout',
  asyncData({ store }) {
    // 페이지 로딩 시 헤더 타이틀을 변경
    const newCustomButtonText = {
      svg: '<svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14" fill="none"><path fill-rule="evenodd" clip-rule="evenodd" d="M5.74353 12.6757C5.74353 12.3622 5.98461 12.1081 6.28199 12.1081H13.4615C13.7589 12.1081 13.9999 12.3622 13.9999 12.6757C13.9999 12.9891 13.7589 13.2432 13.4615 13.2432H6.28199C5.98461 13.2432 5.74353 12.9891 5.74353 12.6757Z" fill="#0C0C20"/><path fill-rule="evenodd" clip-rule="evenodd" d="M5.74353 7.37836C5.74353 7.0649 5.98461 6.81079 6.28199 6.81079H13.4615C13.7589 6.81079 13.9999 7.0649 13.9999 7.37836C13.9999 7.69182 13.7589 7.94593 13.4615 7.94593H6.28199C5.98461 7.94593 5.74353 7.69182 5.74353 7.37836Z" fill="#0C0C20"/><path fill-rule="evenodd" clip-rule="evenodd" d="M5.74353 2.08112C5.74353 1.76766 5.98461 1.51355 6.28199 1.51355H13.4615C13.7589 1.51355 13.9999 1.76766 13.9999 2.08112C13.9999 2.39458 13.7589 2.64868 13.4615 2.64868H6.28199C5.98461 2.64868 5.74353 2.39458 5.74353 2.08112Z" fill="#0C0C20"/><path fill-rule="evenodd" clip-rule="evenodd" d="M3.79101 0.166237C4.00129 0.387886 4.00129 0.74725 3.79101 0.968898L1.63716 3.23917C1.42688 3.46082 1.08594 3.46082 0.87566 3.23917L0.157712 2.48241C-0.0525706 2.26076 -0.0525706 1.9014 0.157712 1.67975C0.367994 1.4581 0.708929 1.4581 0.919211 1.67975L1.25641 2.03518L3.02951 0.166237C3.23979 -0.0554122 3.58072 -0.0554122 3.79101 0.166237Z" fill="#FF505A"/><path fill-rule="evenodd" clip-rule="evenodd" d="M3.79101 5.46354C4.00129 5.68519 4.00129 6.04455 3.79101 6.2662L1.63716 8.53647C1.42688 8.75812 1.08594 8.75812 0.87566 8.53647L0.157712 7.77971C-0.0525706 7.55807 -0.0525706 7.1987 0.157712 6.97705C0.367994 6.7554 0.708929 6.7554 0.919211 6.97705L1.25641 7.33248L3.02951 5.46354C3.23979 5.24189 3.58072 5.24189 3.79101 5.46354Z" fill="#FF505A"/><path fill-rule="evenodd" clip-rule="evenodd" d="M3.79101 10.7608C4.00129 10.9825 4.00129 11.3419 3.79101 11.5635L1.63716 13.8338C1.42688 14.0554 1.08594 14.0554 0.87566 13.8338L0.157712 13.077C-0.0525706 12.8554 -0.0525706 12.496 0.157712 12.2744C0.367994 12.0527 0.708929 12.0527 0.919211 12.2744L1.25641 12.6298L3.02951 10.7608C3.23979 10.5392 3.58072 10.5392 3.79101 10.7608Z" fill="#FF505A"/></svg>', // Updated SVG
      text: '나의 종목 설정'
    }
    store.commit('setPageTitle', '시황 알림 설정')
    store.commit('setCustomButtonText', newCustomButtonText)
    return {}
  }
}
</script>
<style scoped>
@import "~/assets/css/sub/itemSetting.css";
</style>
